hira_kata_gana = {
    # 아
    ord("ぁ"):"ㅏ",ord("あ"):"아",ord("ぃ"):"ㅣ",ord("い"):"이",ord("ぅ"):"ㅜ",ord("う"):"우",ord("ぇ"):"ㅔ",ord("え"):"에",ord("ぉ"):"ㅗ",ord("お"):"오",
    # 카
    ord("か"):"카",ord("が"):"가",ord("き"):"키",ord("ぎ"):"기",ord("く"):"쿠",ord("ぐ"):"구",ord("け"):"케",ord("げ"):"게",ord("こ"):"코",ord("ご"):"고",
    # 사
    ord("さ"):"사",ord("ざ"):"자",ord("し"):"시",ord("じ"):"지",ord("す"):"스",ord("ず"):"즈",ord("せ"):"세",ord("ぜ"):"제",ord("そ"):"소",ord("ぞ"):"조",
    # 타
    ord("た"):"타",ord("だ"):"다",ord("ち"):"치",ord("ぢ"):"지",ord("っ"):"읏",ord("つ"):"츠",ord("づ"):"즈",ord("て"):"테",ord("で"):"데",ord("と"):"토",ord("ど"):"도",
    # 나
    ord("な"):"나",ord("に"):"니",ord("ぬ"):"누",ord("ね"):"네",ord("の"):"노",
    # 하
    ord("は"):"하",ord("ば"):"바",ord("ぱ"):"파",ord("ひ"):"히",ord("び"):"비",ord("ぴ"):"피",
    ord("ふ"):"후",ord("ぶ"):"부",ord("ぷ"):"푸",ord("へ"):"헤",ord("べ"):"베",ord("ぺ"):"페",ord("ほ"):"호",ord("ぼ"):"보",ord("ぽ"):"포",
    # 마
    ord("ま"):"마",ord("み"):"미",ord("む"):"무",ord("め"):"메",ord("も"):"모",
    # 야
    ord("ゃ"):"ㅑ",ord("や"):"야",ord("ゅ"):"ㅠ",ord("ゆ"):"유",ord("ょ"):"ㅛ",ord("よ"):"요",
    # 라
    ord("ら"):"라",ord("り"):"리",ord("る"):"루",ord("れ"):"레",ord("ろ"):"로",
    # 와
    ord("ゎ"):"ㅘ",ord("わ"):"와",ord("ゐ"):"이",ord("ゑ"):"에",ord("を"):"오",ord("ん"):"응",

    # 아
    ord("ァ"):"ㅏ",ord("ア"):"아",ord("ィ"):"ㅣ",ord("イ"):"이",ord("ゥ"):"ㅜ",ord("ウ"):"우",ord("ェ"):"ㅔ",ord("エ"):"에",ord("ォ"):"ㅗ",ord("オ"):"오",
    # 카
    ord("カ"):"카",ord("ガ"):"가",ord("キ"):"키",ord("ギ"):"기",ord("ク"):"쿠",ord("グ"):"구",ord("ケ"):"케",ord("ゲ"):"게",ord("コ"):"코",ord("ゴ"):"고",
    # 사
    ord("サ"):"사",ord("ザ"):"자",ord("シ"):"시",ord("ジ"):"지",ord("ス"):"스",ord("ズ"):"즈",ord("セ"):"세",ord("ゼ"):"제",ord("ソ"):"소",ord("ゾ"):"조",
    # 타
    ord("タ"):"타",ord("ダ"):"다",ord("チ"):"치",ord("ヂ"):"지",ord("ッ"):"읏",ord("ツ"):"츠",ord("ヅ"):"즈",ord("テ"):"테",ord("デ"):"데",ord("ト"):"토",ord("ド"):"도",
    # 나
    ord("ナ"):"나",ord("ニ"):"니",ord("ヌ"):"누",ord("ネ"):"네",ord("ノ"):"노",
    # 하
    ord("ハ"):"하",ord("バ"):"바",ord("パ"):"파",ord("ヒ"):"히",ord("ビ"):"비",ord("ピ"):"피",
    ord("フ"):"후",ord("ブ"):"부",ord("プ"):"푸",ord("ヘ"):"헤",ord("ベ"):"베",ord("ペ"):"페",ord("ホ"):"호",ord("ボ"):"보",ord("ポ"):"포",
    # 마
    ord("マ"):"마",ord("ミ"):"미",ord("ム"):"무",ord("メ"):"메",ord("モ"):"모",
    # 야
    ord("ャ"):"ㅑ",ord("ヤ"):"야",ord("ュ"):"ㅠ",ord("ユ"):"유",ord("ョ"):"ㅛ",ord("ヨ"):"요",
    # 라
    ord("ラ"):"라",ord("リ"):"리",ord("ル"):"루",ord("レ"):"레",ord("ロ"):"로",
    # 와
    ord("ヮ"):"ㅘ",ord("ワ"):"와",ord("ヰ"):"이",ord("ヱ"):"에",ord("ヲ"):"오",ord("ン"):"응",
    }
